benchmark-results/tirion-rust-contract-ko.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /b/contract-ko.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 1 iterations shared among 1 VUs (maxDuration: 10m0s, gracefulStop: 30s)



  █ THRESHOLDS 

    http_req_failed{expected_response:true}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 8       777.807442/s
    checks_succeeded...: 100.00% 8 out of 8
    checks_failed......: 0.00%   0 out of 8

    ✓ valid create 201
    ✓ duplicate 422
    ✓ invalid json 400
    ✓ empty body 400 or 422
    ✓ invalid field 422
    ✓ missing term 400
    ✓ not found 404
    ✓ count 200

    HTTP
    http_req_duration..............: avg=1.1ms  med=412.14µs p(95)=4.16ms p(99)=5.51ms
      { expected_response:true }...: avg=3.28ms med=3.28ms   p(95)=5.59ms p(99)=5.79ms
    http_req_failed................: 75.00% 6 out of 8
      { expected_response:true }...: 0.00%  0 out of 2
    http_reqs......................: 8      777.807442/s

    EXECUTION
    iteration_duration.............: avg=10.2ms med=10.2ms   p(95)=10.2ms p(99)=10.2ms
    iterations.....................: 1      97.22593/s

    NETWORK
    data_received..................: 1.2 kB 113 kB/s
    data_sent......................: 1.1 kB 111 kB/s



running (00m00.0s), 0/1 VUs, 1 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  00m00.0s/10m0s  1/1 shared iters